{
    "maps": {
        "WIZ1TOWN": [
            {
                "name": "Drudgeworth",
                "description": "A bard.",
                "story": [
                    "The Castle had always been a hard place, but it wasn’t always mad.",
                    "They still call him Trebor, the Overlord - because even before the panic took him, he was power-crazed enough to make the title sound like a warning. And then, several years ago, Trebor acquired what every legend insists you should never try to own: a fabled amulet of awesome powers, an artifact with so much myth wrapped around it that merely holding it felt like holding tomorrow hostage.",
                    "He sat in his throne room and gloated - over the empire this amulet would bring him - when something seized him.",
                    "Not a blade. Not poison. Not a coup.",
                    "Fear. Sudden, absolute, incapacitating fear - like the world had shouted a spell directly into his spine.",
                    "When the terror finally passed, Trebor was left trembling... and the amulet was simply gone."
                ]
            },
            {
                "name": "Elira",
                "description": "A lady.",
                "story": [
                    "There was only one wizard Trebor believed capable of that kind of theft.",
                    "Werdna. His arch nemesis. An evil wizard whose very name tastes like a curse when spoken under your breath.",
                    "Trebor barely had time to decide what to do next - because the answer arrived the next day in the language of breaking stone.",
                    "The earth groaned. The Castle rocked. And beneath Trebor’s own seat of power, Werdna used the stolen amulet to carve out a ten-level fortress maze - a deep, engineered wound under the Castle itself, meant as both hideout and taunt.",
                    "Down there, surrounded by monsters most foul, Werdna vanished into the depths and began plumbing the amulet’s secrets to some unknown purpose.",
                    "Whatever was left of Trebor’s sanity snapped cleanly.",
                    "Paranoia became policy. He surrounded himself with an elite guard - the best characters in each class - and obsessed over getting the amulet back.",
                    "But Trebor didn’t just panic. He rebranded.",
                    "If Werdna had made a dungeon under the Castle, then Trebor would pretend it was his idea: special Proving Grounds he’d ordered built to train the bodyguards he needed - an official story that turned humiliation into propaganda. Adventurers would go down, fight, learn, and die... and if any of them happened to bring back the amulet, so much the better.",
                    "And better here does not mean rewarded.",
                    "The objective is blunt: recover the amulet and you’ll be inducted into Trebor’s Elite Guard - by force if need be. The quest is not a contract so much as a trap that happens to point downward."
                ]
            },
            {
                "name": "Garrick",
                "description": "An older warrior.",
                "story": [
                    "The Castle Above the Maze",
                    "This is where your story truly begins - not in heroic sunlight, but in the Castle’s routines and institutions that exist because people keep coming back from the Maze in pieces.",
                    "Within Trebor’s domain are the places every expedition depends on:",
                    "The Training Grounds, ringing with the sounds of swords clashing, where novices practice - so green they’re still hitting pells with wooden blades, yelping when the wood bounces back. This is where new adventurers are created and veterans inspected.",
                    "Gilgamesh’s Tavern, dim and smoke-filled, where parties are assembled - where you try to find a team capable of surviving the rough rigors of the Maze.",
                    "Boltac’s Trading Post, run by a friendly dwarf who loves gold and jokes darkly enough to fit the dungeon: Boltac will sell you your own arms ... if he can get away with it. The spoils of countless forays are fenced here, and it’s open around the clock.",
                    "The Temple of Cant, the first stop when someone returns dead, paralyzed, or otherwise distressed, and the priests name their price in tithes.",
                    "The Adventurer’s Inn, where battered survivors recover and, if they’ve earned it, discover they’ve become something tougher than they were yesterday.",
                    "This is the rhythm of Llylgamyn’s Castle life: recruit, equip, descend; crawl back up; pay the Temple; sleep; repeat."
                ]
            },
            {
                "name": "Sable",
                "description": "An older warrior.",
                "story": [
                    "The Maze Below",
                    "The Maze is not framed as a romantic underworld. It is described like a workplace:",
                    "A place adventurers enter in search of monsters to kill, loot to borrow and clues that might lead them, eventually, to Werdna himself. As skill grows, parties push deeper - until the day they might stand face-to-face with their nemesis.",
                    "And the people who have already gone far enough to understand what eventually really means leave behind the only kind of prophecy that matters down there: survival."
                ]
            }, 
            {
                "name": "Kara Montino",
                "description": "An older warrior.",
                "story": [
                    "The Chronicles of Hawkwind - as if someone tried to write courage into existence. It describes a six-person band on what they believe is the ninth level of the accursed maze, time and distance twisting, reality fleeting.",
                    "They move under magical light, find a secret door, and crash into a fight against hellhounds, demons, and deadly creeping coins.",
                    "They win - only to discover a hidden chute that masks the way to the tenth level, the final path to Werdna’s lair.",
                    "And then - like a signature at the bottom of a death warrant - the air is pierced by a maniacal laugh: Werdna waits.",
                    "That is what the Proving Grounds are: not just corridors, but pressure - applied level by level until only the point remains.",
                    "Trebor wants his amulet. Werdna wants time. The Maze wants bodies.",
                    "And you - freshly named, newly armed, and standing in the Castle above that ten-level wound - are thrust into the situation with the only promise Wizardry ever truly guarantees:",
                    "If you map the Maze, maul the monsters, steal the right goodies, and somehow reach the depths... you might recover the amulet.",
                    "And you might only get killed a few times doing it."
                ]
            }
        ],
        "WIZ2TOWN": [
            {
                "name": "Brother Latumapic",
                "description": "A soft-spoken Bishop and story teller.",
                "story": [
                    "Llylgamyn was built to endure. For ages beyond easy counting, the City of Llylgamyn stood behind a miracle of craft and divinity: the Staff of Gnilda.",
                    "When the staff was set and properly invoked, it spread a barrier around the city - one that did not merely discourage attack, but refused it entirely, turning aside blade and spell alike as if the world itself had decided violence could not cross that threshold.",
                    "Those who approached with honest purpose could pass; those who came with malice found the way denied.",
                    "It was a defense so complete that, for a time, the people of Llylgamyn mistook it for permanence.",
                    "But the staff had a flaw, small as a hairline crack and just as fatal.",
                    "The warding on the staff only judged Outsiders - marauders and invaders - who crept in from beyond the walls. But the staff did not bind the hands of those who were born within Llylgamyn. The city’s sanctum could not condemn its own blood. And in that loophole, darkness found a citizen’s face. His name was Davalpus.",
                    "Davalpus, aided by the powers of darkness, started a coup. The throne was seized. The royal family was slaughtered.",
                    "Only two survived the ruin of the crown: Princess Margda and her brother, Prince Alavik. They fled into the city’s shadows and listened to the oldest whispers — tales of a hero from before recorded reigns, a champion whose armor was not simply steel, but legend made wearable: the Knight of Diamonds. Margda and Alavik wagered everything on that story.",
                    "They found the fabled equipment - piece by piece, relic by relic - and when at last the set was reclaimed, Alavik did what princes do when history offers only one door: he stepped through it. Wearing the Knight’s mystic gear and bearing the Staff of Gnilda, he challenged Davalpus in the castle itself. The battle shook the stones.",
                    "Davalpus fell… but tyrants rarely die quietly. In his last breath he spoke a curse - one so vile the chroniclers refuse to dress it in poetry. The castle collapsed as if yanked down by an invisible fist, burying victor and villain alike. When the dust settled, the royal keep was gone, and in its place yawned a smoking crater - a wound in the earth that would not close. Davalpus, Alavik, and the Staff of Gnilda were lost to the depths. And without the staff, the city’s protection was a memory.",
                    "Now Llylgamyn trembles under the weight of what it once could ignore. Without Gnilda’s ward, threats gather - patient forces that had always waited beyond the barrier, watching, counting, measuring the day the field would fail. If the staff is not returned, the old certainty becomes a new prophecy: the city will fall.",
                    "So the call goes out - not to bright-eyed novices, not to the eager and unscarred, but to those already tempered by impossible corridors and lethal silence. This is not a pilgrimage for the untested. It is a scenario meant for experienced Wizardry adventurers, and the old notices speak bluntly: champions around the 13th level are needed just to endure what waits below. You are summoned because you are what Llylgamyn has left. Not an army. Not a parade of banners. A small company - one to six souls if fate is kind—armed with hard-earned spells and the kind of caution that only survives by learning.",
                    "Beneath the ruined castle stretches a six-level maze, a stacked anatomy of deception and stone where the relics of the Knight of Diamonds have become both lure and lock."
                ]
            },
            {
                "name": "Alavik",
                "description": "A old warrior prince.",
                "story": [
                    "The quest is cruelly circular: To reclaim the Staff of Gnilda, you must first reclaim what once made Alavik worthy to wield it.",
                    "The Five Relics of the Knight: Deep in the maze, five pieces of the Knight’s equipment must be gathered - trophies not merely found, but won, for each is guarded by a living paradox: the item itself turned hostile, an animated threat waiting near the ends of the lower roads.",
                    "KOD’s Armor - accessible only by a precise leap of wizardry: the way is hinted, and the key moment demands the spell MALOR, three squares east, as if the dungeon itself insists you earn the shortcut.",
                    "KOD’s Shield - locked behind a riddle whose answer is as plain as it is dangerous to speak wrong: shield.",
                    "Hrathnir - the Knight’s blade, taken from the defeat of a Magic Sword that does not lie still like honest steel.",
                    "KOD’s Helm - reached past warning rhymes and a deceptively clear blue fountain that can steal consciousness with a step.",
                    "KOD’s Gauntlets - claimed by defeating two animated gauntlets, and learning - often too late - that some doors here are invisible even in magical light; only stubborn footsteps find what eyes cannot.",
                    "All the while, the maze mutters its own rules: sages demand fortunes to pass, certain spells behave “stronger” or strangely altered, and the deepest level denies some forms of magical sight outright."
                ]
            },
            {
                "name": "Margda",
                "description": "An elegant older lady.",
                "story": [
                    "The Sixth Level and the Sphinx",
                    "At the bottom, the dungeon stops pretending it is merely architecture and becomes a rite.",
                    "There is a statue of Gnilda-named not just as a goddess but as an earth power, present in stone and warning. Nearby waits a sphinx with a riddle that is less puzzle than identity-test. The maze speaks a final instruction like a knife-edge: one alone.",
                    "The correct response is not the name of a king, nor a spell, nor a treasure.",
                    "It is a title.",
                    "It is the point.",
                    "The Knight of Diamonds.",
                    "And then, as if to ensure you understand: you must return to Gnilda’s temple and speak that answer again-alone, bearing all five relics. If you fail, the dungeon’s mercy is nonexistent; if you succeed, the price is total: the relics are surrendered, and the Staff of Gnilda is finally returned to mortal hands.",
                    "Only then may you climb back toward daylight with the one thing that can save Llylgamyn.",
                    "Only then can you become what the city no longer has:",
                    "A shield that works from within as well as without.",
                    "So steel your nerves. Count your torches. Speak carefully when the stones ask questions. And remember that the maze beneath Llylgamyn is not merely guarding treasure.",
                    "It is guarding a succession.",
                    "Because when you return, staff in hand, the city will not only be saved - it will need someone new to wear a legend."
                ]
            }
        ],
        "WIZ3TOWN": [
            {
                "name": "Lyrra",
                "description": "An attractive lady.",
                "story": [
                    "A generation has passed since the day the old legends became real again.",
                    "Once, Llylgamyn was saved by steel and sorcery - by an intrepid band who recovered the ancient armor of the Knight of Diamonds and restored the Staff of Gnilda to its rightful place.",
                    "With the staff’s protection returned, peace did not merely hold. It prevailed.",
                    "The kingdom grew prosperous. Under that shelter, Llylgamyn became a place of light and beauty, so secure that war and its tools became almost unthinkable.",
                    "Then the trouble came... and it did not come with banners.",
                    "It came as unbalanced nature - years of unsettling reports that most citizens waved away: freak earthquakes, sudden shifts in climate, thundering storms and tidal waves, strange portents piling up like clouds on the horizon.",
                    "Until the sea itself made the argument impossible to ignore.",
                    "Far from the castle, the prosperous island colony of Arbithea - once surrounded by gentle waters - was swallowed in a single, catastrophic rise.",
                    "The tidal wave tore the cities apart and left only barren peaks above the waterline, like the broken teeth of a drowned world.",
                    "After that, denial died quickly."
                ]
            },
            {
                "name": "Penneth",
                "description": "An regal lord.",
                "story": [
                    "Soon Llylgamyn was struck by an earthquake so mighty that even the Temple of Gnilda was damaged - its stones bruised, its sanctity visibly wounded. Nearby volcanoes, long dormant, stirred awake from ancient slumbers.",
                    "As fear spread, everyone had an explanation - and none of them agreed.",
                    "Self-appointed prophets cried divine wrath and demanded immediate repentance.",
                    "Mystics consulted the Tarot. Astrologers warned of great comets destined to crash into the world and bring total destruction.",
                    "Priests of the old religions spoke in apocalyptic terms: the death of the Great World Serpent, and the end of existence itself.",
                    "But the wisest voices in the kingdom refused to settle for panic.",
                    "They called instead for a new generation of adventurers, of every creed and calling, to find the truth behind the disasters - just as heroes had done in the old days.",
                    "And in the councils of the greatest sages and wizards, a hard conclusion formed: only one relic remained with the power to reveal the source of the danger.",
                    "That relic was a scrying treasure of legend:",
                    "the Orb of Earithin."
                ]
            },
            {
                "name": "Orin",
                "description": "An wise councillor.",
                "story": [
                    "Long ago, the orb was taken by the great dragon L’kbreth - one of the five children of the World Serpent, and a being devoted not to conquest, but to the balance of the world.",
                    "In the lore preserved by Llylgamyn’s scholars, L’kbreth judged that the orb could upset that balance if it remained in mortal hands, and so she carried it to her mountain sanctuary.",
                    "There, she invoked both good and evil powers to protect the orb from thieves and unworthy seekers.",
                    "Now the leaders of Llylgamyn make their plea to you.",
                    "Not to strangers, not to random sellswords - to descendants.",
                    "To the children of those who survived the Proving Grounds of the Mad Overlord, and to the heirs of the heroes of the Knight of Diamonds.",
                    "You are called to take up their memory and skill, to seek out L’kbreth in her lair, and to win from her the Orb of Earithin - because without it, Llylgamyn is facing a doom no wall can hold back."
                ]
            },
            {
                "name": "FitzChivalry",
                "description": "An stout man.",
                "story": [
                    "The Rite of Passage",
                    "This is not the old age, when veteran mercenaries drifted into taverns and formed parties on a whim.",
                    "This time, the chosen come from a single cohort: this year’s graduating apprentices.",
                    "At the age of twenty, each apprentice undergoes the ancient Rite of Passage.",
                    "After the proper rituals, they pray to the spirits of their ancestors for guidance and aid - spirits that are not metaphor, but the essence of heroes who once defeated Werdna for his amulet, or returned Gnilda’s staff to protect the land.",
                    "If the apprentice is deemed worthy, the blessing is tangible:",
                    "These new, level-one adventurers inherit a portion of their ancestors’ abilities as rightful heritage.",
                    "Their attributes may be enhanced; their aptitude for their craft sharpened - less trained than bequeathed.",
                    "And the inheritance isn’t only talent.",
                    "The apprentices proudly bear the names of their forebears into battle.",
                    "Family caste and honors may pass with the blessing as well - high ranks such as Ninja or Lord, and historic distinctions like chevrons and knighthoods - titles that are not costume, but obligation.",
                    "Such a legacy, the elders warn, is a heavy burden: family honor must be upheld, or the fall is sharper for having started so high.",
                    "When the ceremony ends, the ancestral link fades. Only the newly graduated character remains - gifted, yes, but now required to prove worthy of the power placed in their hands."
                ]
            },
            {
                "name": "Nettle",
                "description": "An young woman.",
                "story": [
                    "Graduation Day: The Quest Revealed",
                    "Upon completion of the Rite, the new adventurers are gathered before the Elders of Llylgamyn.",
                    "There the burden of the quest is placed squarely on their shoulders - and the truth is spoken plainly: the newly awakened volcano that threatens the city is not merely geology.",
                    "It is the legendary sanctuary of L’kbreth herself, the mountain-lair where she guards the orb from the unworthy.",
                    "High within that mountain is the hidden resting place of the Orb of Earithin.",
                    "To reach it, the party must climb twisted passageways through L’kbreth’s domain - an inversion of the usual descent into darkness, as though the world is forcing you upward into the dragon’s breath.",
                    "Along the way, the dragon’s protections take shape: good and evil magics woven together, legions of monsters and hostile troops, diabolical traps, and riddles designed not to entertain, but to test.",
                    "Tradition is merciless: the new adventurers begin the quest without weapons or armor.",
                    "On graduation, the elders provide only a starting purse - up to 500 gold pieces - and the rest must be earned in the mountain’s teeth.",
                    "So that is Llylgamyn’s legacy, now placed in your hands:",
                    "A city once protected by sacred relics.",
                    "A world suddenly shaken by sea and fire. A dragon sworn to balance, guarding the one tool that can reveal what’s gone wrong.",
                    "And a new generation - descendants wearing old names - sent into a volcano-lair where even morality itself may be part of the lock and key."
                ]
            }
        ],
        "WIZ4TOWN": [
            {
                "name": "FitzChivalry",
                "description": "A stout man.",
                "story": [
                    "Five years.",
                    "That is how long it had been since Werdna seized the mystical amulet that would make lesser men weep and greater men go mad with wanting.",
                    "Trebor’s agents had nearly beaten him to it - hours, not days - snatching the artifact from an ancient crumbling Temple hidden in a mist-choked valley whispered of in forbidden tomes: a place called the Gods’ Hopyard, where legends claim a portal once opened and the Gods themselves came to play.",
                    "Until something greater spoke, the world froze, and the gate imploded shut.",
                    "When mortals dared the valley afterward, they found that impossible Temple, and at its heart a statue wearing an amulet that radiated such power that eyes could not linger on it.",
                    "Scholars argued for millennia about what the amulet was: a key to reopen the portal, a relic abandoned during the Gods’ retreat, or - most disturbing of all - an instrument of whatever force drove the Gods away, perhaps stronger than the Gods themselves.",
                    "Thieves and mages tried and failed to claim it across the ages.",
                    "Werdna was intrigued, but not foolish; without safeguards, the Temple devoured the ambitious."
                ]
            },
            {
                "name": "Nighteyes",
                "description": "A wolf.",
                "story": [
                    "Then fate offered Werdna a hook: an antique dealer with a sealed scroll. It cost him dearly - though not as dearly as it should have - because when he touched the seal, it came free too easily.",
                    "The scroll had been opened and resealed, and its text was in a tongue unknown even to me.",
                    "He restored the faded script by art, but translating the meaning took nearly a year.",
                    "In the ravings of an ancient apprentice who witnessed that night of divine trespass, one clue repeated like a bruise: the glowing eye of THE GOD - the amulet - and a frantic confession about Mythril Gauntlets lost and forgiveness begged.",
                    "His agents searched and found only one gauntlet.",
                    "One would have to do."
                ]
            },
            {
                "name": "Jinna",
                "description": "An hedge witch.",
                "story": [
                    "When Werdna reached the Temple, the amulet was already gone.",
                    "Footprints in dust became hard ground outside; hard ground became nothing.",
                    "So Werdna did what Trebor never imagined anyone could do to him: Werdna hunted the trail back to his castle, learned he possessed a copy of the scroll, and Malor’d into his seat of power.",
                    "While his pets kept his guards occupied, Werdna cast Mamorlis and watched the Mad Overlord freeze in pure terror upon his throne.",
                    "Trebor wore the mystic gauntlet - and from it hung the captured sun itself.",
                    "Werdna took the amulet from his hand and, for a parting gift, left behind one of my Damien stones.",
                    "At last the amulet was mine… and I immediately did what all tyrants do when handed infinity:",
                    "I tried to build a monument to myself."
                ]
            },
            {
                "name": "Starling",
                "description": "An attractive minstrel.",
                "story": [
                    "Ten levels. A fortress beneath Trebor’s castle - close enough to steal from, close enough to mock.",
                    "Werdna opened only a tiny conduit to the amulet to draw power for conjuring, and the backlash nearly vaporized him.",
                    "The ground under the castle melted and twisted like pulled taffy.",
                    "His tower was obliterated; my new underground maze existed, but wilder than intended.",
                    "Shaken, Werdna swore not to invoke the amulet again until he learned how to channel it safely.",
                    "Five years passed. The amulet yielded almost nothing - except one lesson, discovered the stupid way: a minion fetched it without the gauntlet, touched it, and simply vanished, leaving only the amulet clattering to the floor.",
                    "That could have been Werdna. From then on the gauntlet stayed with the case so he could not forget."
                ]
            },
            {
                "name": "Burrich",
                "description": "A solemn stable master.",
                "story": [
                    "Then came the interruption that history likes to call heroic.",
                    "One evening, while Werdna entertained a Vampire Lord and his liegemen, the door to his study crashed open and a wild-eyed party surged in - adventurers bent on my destruction.",
                    "His pentagram for summoning allies was out of reach, and the amulet was too far to seize in time.",
                    "Werdna gathered power and began to cast Tiltowait as my guests rushed to defend me - only to see the Vampire Lord dissolved by a Zilwan spell.",
                    "They had a high mage. They endured Tiltowait.",
                    "And before Werdna could unleash a second, their leader stepped inside his guard and struck a critical hit.",
                    "As darkness took Werdna, he heard one of them say - clear as a knife - Hawkwind had the amulet and Trebor would be pleased.",
                    "They thought Werdna was dead.",
                    "Foolish mortals."
                ]
            },
            {
                "name": "Molly",
                "description": "An beekeeper and candle maker.",
                "story": [
                    "When the authorities realized his body was not rotting but locked in a deep trance - indestructible, unkillable by ordinary means - they did not bury me with honors or burn me with fear.",
                    "They did something colder: they adapted an ancient subterranean ruin into an escape-proof prison around my bier, packed it with patrols, traps, and guardians, and left me at the bottom of the very labyrinth Werdna had created.",
                    "And now Werdna awakens.",
                    "A small room.",
                    "No doors.",
                    "Werdnas powers drained, his strength as weak as a newborn babe.",
                    "Above him, ten levels of hostile stone and righteous violence - an entire world of do-gooders who believe the story ends with the villain slain.",
                    "It doesn’t.",
                    "Because he is Werdna, and this is not a quest to save Llylgamyn.",
                    "This is a crawl upward through my stolen prison to reclaim what was taken - his amulet, his power, and his revenge.",
                    "Until Werdna can finally put his hands on the one name he hates even more than Hawkwind’s:",
                    "Trebor."
                ]
            }
        ],
        "DQTOWN": [
            {
                "name": "Dutiful",
                "description": "A stout man.",
                "story": [
                    "The frontier has a way of making liars out of maps.",
                    "North of you are the Confederated Baronies - hard country, hard people, and laws that hold mostly because steel backs them.",
                    "South lie the old realms: the ancient and decadent kingdoms that once ruled by inheritance and memory, and now mostly rule by habit.",
                    "Between those powers stretches a semi-settled borderland - the Frontiers of Alusia, a place with just enough roads to get you killed on schedule.",
                    "To the east is the Sea of Grass, a steppe that seems endless until it isn’t - wide enough to hide whole nations of raiders and the old scars of fallen cities.",
                    "To the west is the Alusian Ocean, a gray, storm-prone void that sailors whisper is bottomless and world-ending, because the alternative is to admit it’s simply indifferent.",
                    "In the middle are the thin lifelines: rivers, ferries, and the stubborn commerce of people who refuse to move back home.",
                    "Two names come up again and again in tavern talk and caravan ledgers: the Barony of Carzala and the Brastor Holding - the region’s closest things to stability.",
                    "They trade with each other along the waterways and overland routes that cut through the wild, forming a single economic spine for the scattered settlements that cling to coast and riverbank.",
                    "The greatest artery is the Sweetwater River - broad, old, and treacherous in its calm.",
                    "It’s said to run from the Sea of Grass to Confederation Bay; it is over a mile wide through most of its course, and it does not forgive the careless.",
                    "Outside of ferries and a few hard-won fords (or a strong horse and a reckless rider), it is a barrier as much as it is a route.",
                    "This is the kind of place where civilization means a castle with a working gate, and where the only honest prayer is: let the road be quiet today.",
                    "The world’s rules are not your rules - out here, magic doesn’t feel like a parlor trick.",
                    "It feels like a leak."
                ]
            },
            {
                "name": "Riddle",
                "description": "A stout man.",
                "story": [
                    "DragonQuest lore speaks of magic as something that happens where planes press too close - energy bleeding between dimensions, shaped by those with the talent and training to seize it.",
                    "Such practitioners are called Adepts, and their arts are organized into separate Colleges of Magic, each with its own disciplines, spells, and taboos.",
                    "Among those Colleges is one feared by soldiers and priests alike: Illusions.",
                    "Illusion-work is not merely pretty lights.",
                    "Properly crafted, it can fool senses, twist judgment, and - under particular conditions - harm.",
                    "In the DragonQuest tradition, an illusion that truly injures must include a tactile component paired with an effect aimed at the victim’s primary sense; lesser illusions can still mislead, terrify, or cripple decisions at exactly the wrong moment.",
                    "People in the Baronies call that sort of magic cowardice.",
                    "People in the Frontiers call it Tuesday."
                ]
            }, {
                "name": "Perseverance",
                "description": "A stout man.",
                "story": [
                    "The newest terror in Alusia has a name spoken softly around fires.",
                    "Loktar - a dragon whose cruelty is as deliberate as it is immense.",
                    "The beasts and demonic forces that prowl the wilderness were always there in one form or another, but Loktar made them feel coordinated - like a hand closing into a fist.",
                    "And then came the insult that turned fear into mobilization:",
                    "Princess Persia - symbol, hostage, leverage - taken into Loktar’s grasp.",
                    "No one agrees on the exact night.",
                    "Some insist the sky flashed green.",
                    "Some swear the castle guards saw the Princess walk into the fog as if summoned.",
                    "Some claim the dragon never crossed the walls at all - that only a shadow did, and that the shadow was enough.",
                    "But the result is the same: a royal captive, a realm trembling, and a frontier that cannot afford to look weak."
                ]
            }, {
                "name": "Careful",
                "description": "A stout man.",
                "story": [
                    "The King’s Treasure Room",
                    "The order goes out: Find the Princess.",
                    "Break Loktar’s hold.",
                    "Save Alusia.",
                    "The path to that salvation does not lead to a battlefield.",
                    "It leads downward - into a place spoken of with the uneasy tone normally reserved for graves: the King’s Treasure Room.",
                    "Despite the name, no one imagines a glittering chamber and an obliging chest.",
                    "They mean a vault-complex, a layered understructure of defenses and dead ends - booby-trapped not just with blades and poison, but with architectural malice: spaces designed to confuse, to separate, to exhaust.",
                    "Even before Loktar, it was a nightmare made for thieves.",
                    "With Loktar’s influence, it becomes something worse: a maze where your senses can betray you and where the dark itself may be weaponized."
                ]
            }, {
                "name": "Shun",
                "description": "A stout man.",
                "story": [
                    "The Frontier’s veterans tell the same story in different words.",
                    "Each level has its own theme.",
                    "Which is how survivors explain why the horrors change, and why tactics that worked yesterday stop working today.",
                    "The deeper you go, the richer the rewards - and the less forgiving the mistakes.",
                    "And when your company is assembled, you do what adventurers have always done on the edge of maps:",
                    "You count torches.",
                    "You check straps.",
                    "You memorize the feel of your last clean breath.",
                    "Because beyond the doors is a three-dimensional ruin of stairs, pits, chutes, teleports, elevators, and regions where light and magic may fail you - an underworld built to punish certainty.",
                    "And somewhere, at the bottom of the designs and the lies, Loktar’s grip on the Princess - whether it is chain, spell, or the subtler kind of prison where the captive can no longer trust their own eyes.",
                    "So here is the oath, spoken plainly because the frontier doesn’t respect poetry:",
                    "You will go down.",
                    "You will bring back the Princess.",
                    "You will break the dragon’s claim.",
                    "You will survive the King’s Treasure Room - booby traps and all.",
                    "And if you find treasure along the way?",
                    "Try not to die counting it."
                ]
            }
        ],
        "BSTOWN": [
            {
                "name": "Revel",
                "description": "A stout man.",
                "story": [
                    "Your quest is to descend into the dungeons beneath the cit - the Black Stone - and only by regaining this gem and returning it to its rightful owner, your master, Lord Valacar, can the city be saved from evil.",
                    "Along the way you will face the minions of Llorgarth and other denizens of the maze, together with the tricks and traps the lich has set to defend his stronghold.",
                    "But you may also find help from unexpected quarters.",
                    "Good Luck!!!"
                ]
            }
        ],
        "ULT3TOWN": [
            {
                "name": "Chade",
                "description": "A wise councillor.",
                "story": [
                    "I am the warden of this temple and guard what it contains, and have deeper knowledge about the 4 Marks.",
                    "Seek the four marks in the dungeons.  The Mark of Kings, the Mark of Force, the Mark of Fire and the Mark of the Snake.",
                    "The Mark of Fire can be found at the bottom of the dungeons of Perinean, Fire and Morinia. Only with the Mark of Fire can you be granted entry.",
                    "The Mark of Force can be found at the bottom of the dungeons of Fire and Doom.",
                    "The Mark of Snake can be found at the bottom of the dungeon of the Snake.",
                    "The Mark of Kings is more common and can be found in the dungeons of Perinean, Morinia, Dardens Pit, Snake and Time."
                ]
            }
        ]
    }
}